benchmark_output_logs/hbase_YCSB_workload_f_20211209_193020.out
/usr/lib/jvm/zulu-8-azure-amd64/bin/java -cp /etc/hbase/conf:/home/sshuser/ycsb-0.17.0/hbase12-binding/conf:/home/sshuser/ycsb-0.17.0/conf:/home/sshuser/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/sshuser/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/sshuser/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/sshuser/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/sshuser/ycsb-0.17.0/lib/core-0.17.0.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/hbase12-binding-0.17.0.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/log4j-1.2.17.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/commons-logging-1.2.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/hbase10-binding-0.17.0.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/findbugs-annotations-1.3.9-1.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/slf4j-api-1.7.25.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/hbase-shaded-client-1.2.5.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/htrace-core-3.1.0-incubating.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/slf4j-log4j12-1.6.1.jar site.ycsb.Client -db site.ycsb.db.hbase12.HBaseClient12 -P ycsb-0.17.0/workloads/workloadf -p table=usertable -p columnfamily=cf -p recordcount=100000 -p threadcount=24 -s -load
Command line: -db site.ycsb.db.hbase12.HBaseClient12 -P ycsb-0.17.0/workloads/workloadf -p table=usertable -p columnfamily=cf -p recordcount=100000 -p threadcount=24 -s -load
YCSB Client 0.17.0

Loading workload...
log4j:ERROR Could not instantiate class [com.microsoft.log4jappender.FilterLogAppender].
java.lang.ClassNotFoundException: com.microsoft.log4jappender.FilterLogAppender
	at java.net.URLClassLoader.findClass(URLClassLoader.java:387)
	at java.lang.ClassLoader.loadClass(ClassLoader.java:419)
	at sun.misc.Launcher$AppClassLoader.loadClass(Launcher.java:352)
	at java.lang.ClassLoader.loadClass(ClassLoader.java:352)
	at java.lang.Class.forName0(Native Method)
	at java.lang.Class.forName(Class.java:264)
	at org.apache.log4j.helpers.Loader.loadClass(Loader.java:198)
	at org.apache.log4j.helpers.OptionConverter.instantiateByClassName(OptionConverter.java:327)
	at org.apache.log4j.helpers.OptionConverter.instantiateByKey(OptionConverter.java:124)
	at org.apache.log4j.PropertyConfigurator.parseAppender(PropertyConfigurator.java:785)
	at org.apache.log4j.PropertyConfigurator.parseCategory(PropertyConfigurator.java:768)
	at org.apache.log4j.PropertyConfigurator.configureRootCategory(PropertyConfigurator.java:648)
	at org.apache.log4j.PropertyConfigurator.doConfigure(PropertyConfigurator.java:514)
	at org.apache.log4j.PropertyConfigurator.doConfigure(PropertyConfigurator.java:580)
	at org.apache.log4j.helpers.OptionConverter.selectAndConfigure(OptionConverter.java:526)
	at org.apache.log4j.LogManager.<clinit>(LogManager.java:127)
	at org.apache.log4j.Logger.getLogger(Logger.java:104)
	at org.apache.htrace.shaded.commons.logging.impl.Log4JLogger.getLogger(Log4JLogger.java:289)
	at org.apache.htrace.shaded.commons.logging.impl.Log4JLogger.<init>(Log4JLogger.java:109)
	at sun.reflect.NativeConstructorAccessorImpl.newInstance0(Native Method)
	at sun.reflect.NativeConstructorAccessorImpl.newInstance(NativeConstructorAccessorImpl.java:62)
	at sun.reflect.DelegatingConstructorAccessorImpl.newInstance(DelegatingConstructorAccessorImpl.java:45)
	at java.lang.reflect.Constructor.newInstance(Constructor.java:423)
	at org.apache.htrace.shaded.commons.logging.impl.LogFactoryImpl.createLogFromClass(LogFactoryImpl.java:1116)
	at org.apache.htrace.shaded.commons.logging.impl.LogFactoryImpl.discoverLogImplementation(LogFactoryImpl.java:914)
	at org.apache.htrace.shaded.commons.logging.impl.LogFactoryImpl.newInstance(LogFactoryImpl.java:604)
	at org.apache.htrace.shaded.commons.logging.impl.LogFactoryImpl.getInstance(LogFactoryImpl.java:336)
	at org.apache.htrace.shaded.commons.logging.impl.LogFactoryImpl.getInstance(LogFactoryImpl.java:310)
	at org.apache.htrace.shaded.commons.logging.LogFactory.getLog(LogFactory.java:685)
	at org.apache.htrace.core.HTraceConfiguration.<clinit>(HTraceConfiguration.java:31)
	at org.apache.htrace.core.Tracer$Builder.<init>(Tracer.java:47)
	at site.ycsb.Client.getTracer(Client.java:458)
	at site.ycsb.Client.main(Client.java:304)
log4j:ERROR Could not instantiate appender named "FilterLog".
Starting test.
2021-12-09 19:30:21:385 0 sec: 0 operations; est completion in 0 second 
2021-12-09 19:30:21,427 WARN  [Thread-23] util.NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
2021-12-09 19:30:21,934 INFO  [Thread-23] zookeeper.RecoverableZooKeeper: Process identifier=hconnection-0x22135e10 connecting to ZooKeeper ensemble=zk0-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net:2181,zk3-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net:2181,zk1-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net:2181
2021-12-09 19:30:21,940 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:zookeeper.version=3.4.6-1569965, built on 02/20/2014 09:09 GMT
2021-12-09 19:30:21,940 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:host.name=hn0-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net
2021-12-09 19:30:21,940 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:java.version=1.8.0_312
2021-12-09 19:30:21,940 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:java.vendor=Azul Systems, Inc.
2021-12-09 19:30:21,941 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:java.home=/usr/lib/jvm/zulu-8-azure-amd64/jre
2021-12-09 19:30:21,942 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:java.class.path=/etc/hbase/conf:/home/sshuser/ycsb-0.17.0/hbase12-binding/conf:/home/sshuser/ycsb-0.17.0/conf:/home/sshuser/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/sshuser/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/sshuser/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/sshuser/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/sshuser/ycsb-0.17.0/lib/core-0.17.0.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/hbase12-binding-0.17.0.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/log4j-1.2.17.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/commons-logging-1.2.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/hbase10-binding-0.17.0.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/findbugs-annotations-1.3.9-1.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/slf4j-api-1.7.25.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/hbase-shaded-client-1.2.5.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/htrace-core-3.1.0-incubating.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/slf4j-log4j12-1.6.1.jar
2021-12-09 19:30:21,942 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:java.library.path=/usr/java/packages/lib/amd64:/usr/lib64:/lib64:/lib:/usr/lib
2021-12-09 19:30:21,942 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:java.io.tmpdir=/tmp
2021-12-09 19:30:21,942 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:java.compiler=<NA>
2021-12-09 19:30:21,942 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:os.name=Linux
2021-12-09 19:30:21,942 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:os.arch=amd64
2021-12-09 19:30:21,942 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:os.version=5.4.0-1063-azure
2021-12-09 19:30:21,942 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:user.name=sshuser
2021-12-09 19:30:21,942 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:user.home=/home/sshuser
2021-12-09 19:30:21,942 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:user.dir=/home/sshuser
2021-12-09 19:30:21,943 INFO  [Thread-23] zookeeper.ZooKeeper: Initiating client connection, connectString=zk0-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net:2181,zk3-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net:2181,zk1-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net:2181 sessionTimeout=120000 watcher=hconnection-0x22135e100x0, quorum=zk0-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net:2181,zk3-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net:2181,zk1-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net:2181, baseZNode=/hbase-unsecure
2021-12-09 19:30:21,980 INFO  [Thread-23-SendThread(zk3-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net:2181)] zookeeper.ClientCnxn: Opening socket connection to server zk3-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net/10.0.0.6:2181. Will not attempt to authenticate using SASL (unknown error)
2021-12-09 19:30:21,996 INFO  [Thread-23-SendThread(zk3-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net:2181)] zookeeper.ClientCnxn: Socket connection established to zk3-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net/10.0.0.6:2181, initiating session
2021-12-09 19:30:22,011 INFO  [Thread-23-SendThread(zk3-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net:2181)] zookeeper.ClientCnxn: Session establishment complete on server zk3-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net/10.0.0.6:2181, sessionid = 0x37da07e243a0028, negotiated timeout = 120000
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2021-12-09 19:30:31:367 10 sec: 7620 operations; 761.92 current ops/sec; est completion in 2 minutes [INSERT: Count=7620, Max=283391, Min=5316, Avg=27699.83, 90=42463, 99=150271, 99.9=245887, 99.99=262911] 
2021-12-09 19:30:41:367 20 sec: 16756 operations; 913.6 current ops/sec; est completion in 1 minute [INSERT: Count=9136, Max=258431, Min=4828, Avg=26126.58, 90=40479, 99=115327, 99.9=247935, 99.99=256767] 
2021-12-09 19:30:51:367 30 sec: 25392 operations; 863.6 current ops/sec; est completion in 1 minute [INSERT: Count=8636, Max=476159, Min=4880, Avg=27601.07, 90=40607, 99=147839, 99.9=421119, 99.99=474623] 
2021-12-09 19:31:01:367 40 sec: 34793 operations; 940.1 current ops/sec; est completion in 1 minute [INSERT: Count=9401, Max=364543, Min=4752, Avg=25808.83, 90=40831, 99=102591, 99.9=293631, 99.99=359167] 
2021-12-09 19:31:11:367 50 sec: 44258 operations; 946.5 current ops/sec; est completion in 1 minute [INSERT: Count=9465, Max=226175, Min=5068, Avg=25323.38, 90=39967, 99=70399, 99.9=183551, 99.99=223487] 
2021-12-09 19:31:21:367 60 sec: 53467 operations; 920.9 current ops/sec; est completion in 53 seconds [INSERT: Count=9209, Max=271359, Min=4476, Avg=26065.53, 90=39295, 99=94847, 99.9=242815, 99.99=271103] 
2021-12-09 19:31:31:367 70 sec: 60898 operations; 743.17 current ops/sec; est completion in 45 seconds [INSERT: Count=7431, Max=447231, Min=4776, Avg=32295.34, 90=45503, 99=250623, 99.9=399871, 99.99=443903] 
2021-12-09 19:31:41:367 80 sec: 70233 operations; 933.41 current ops/sec; est completion in 34 seconds [INSERT: Count=9335, Max=283391, Min=4940, Avg=25701.29, 90=40415, 99=88447, 99.9=223999, 99.99=279295] 
2021-12-09 19:31:51:367 90 sec: 78487 operations; 825.4 current ops/sec; est completion in 25 seconds [INSERT: Count=8255, Max=297471, Min=4884, Avg=29091.31, 90=44255, 99=199167, 99.9=276991, 99.99=294399] 
2021-12-09 19:32:01:367 100 sec: 86593 operations; 810.6 current ops/sec; est completion in 16 seconds [INSERT: Count=8105, Max=379903, Min=4808, Avg=29578.68, 90=41887, 99=255231, 99.9=365055, 99.99=379903] 
2021-12-09 19:32:11:367 110 sec: 95069 operations; 847.6 current ops/sec; est completion in 6 second [INSERT: Count=8477, Max=386047, Min=4956, Avg=28339.65, 90=41279, 99=227455, 99.9=359167, 99.99=386047] 
2021-12-09 19:32:17,999 INFO  [Thread-3] client.ConnectionManager$HConnectionImplementation: Closing zookeeper sessionid=0x37da07e243a0028
2021-12-09 19:32:18,005 INFO  [Thread-3] zookeeper.ZooKeeper: Session: 0x37da07e243a0028 closed
2021-12-09 19:32:18,005 INFO  [Thread-23-EventThread] zookeeper.ClientCnxn: EventThread shut down
2021-12-09 19:32:18:016 116 sec: 100000 operations; 741.62 current ops/sec; [CLEANUP: Count=48, Max=47263, Min=2, Avg=999.25, 90=17, 99=47263, 99.9=47263, 99.99=47263] [INSERT: Count=4930, Max=527359, Min=5004, Avg=27440.65, 90=38335, 99=239999, 99.9=518143, 99.99=527359] 
[OVERALL], RunTime(ms), 116650
[OVERALL], Throughput(ops/sec), 857.2653236176596
[TOTAL_GCS_PS_Scavenge], Count, 42
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 197
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.16888126875267895
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 42
[TOTAL_GC_TIME], Time(ms), 197
[TOTAL_GC_TIME_%], Time(%), 0.16888126875267895
[CLEANUP], Operations, 48
[CLEANUP], AverageLatency(us), 999.25
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 47263
[CLEANUP], 95thPercentileLatency(us), 29
[CLEANUP], 99thPercentileLatency(us), 47263
[INSERT], Operations, 100000
[INSERT], AverageLatency(us), 27457.89722
[INSERT], MinLatency(us), 4476
[INSERT], MaxLatency(us), 527359
[INSERT], 95thPercentileLatency(us), 51103
[INSERT], 99thPercentileLatency(us), 168831
[INSERT], Return=OK, 100000
/usr/lib/jvm/zulu-8-azure-amd64/bin/java -cp /etc/hbase/conf:/home/sshuser/ycsb-0.17.0/hbase12-binding/conf:/home/sshuser/ycsb-0.17.0/conf:/home/sshuser/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/sshuser/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/sshuser/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/sshuser/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/sshuser/ycsb-0.17.0/lib/core-0.17.0.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/hbase12-binding-0.17.0.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/log4j-1.2.17.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/commons-logging-1.2.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/hbase10-binding-0.17.0.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/findbugs-annotations-1.3.9-1.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/slf4j-api-1.7.25.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/hbase-shaded-client-1.2.5.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/htrace-core-3.1.0-incubating.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/slf4j-log4j12-1.6.1.jar site.ycsb.Client -db site.ycsb.db.hbase12.HBaseClient12 -P ycsb-0.17.0/workloads/workloadf -p table=usertable -p columnfamily=cf -p recordcount=100000 -p operationcount=100000 -p threadcount=24 -s -t
Command line: -db site.ycsb.db.hbase12.HBaseClient12 -P ycsb-0.17.0/workloads/workloadf -p table=usertable -p columnfamily=cf -p recordcount=100000 -p operationcount=100000 -p threadcount=24 -s -t
YCSB Client 0.17.0

Loading workload...
log4j:ERROR Could not instantiate class [com.microsoft.log4jappender.FilterLogAppender].
java.lang.ClassNotFoundException: com.microsoft.log4jappender.FilterLogAppender
	at java.net.URLClassLoader.findClass(URLClassLoader.java:387)
	at java.lang.ClassLoader.loadClass(ClassLoader.java:419)
	at sun.misc.Launcher$AppClassLoader.loadClass(Launcher.java:352)
	at java.lang.ClassLoader.loadClass(ClassLoader.java:352)
	at java.lang.Class.forName0(Native Method)
	at java.lang.Class.forName(Class.java:264)
	at org.apache.log4j.helpers.Loader.loadClass(Loader.java:198)
	at org.apache.log4j.helpers.OptionConverter.instantiateByClassName(OptionConverter.java:327)
	at org.apache.log4j.helpers.OptionConverter.instantiateByKey(OptionConverter.java:124)
	at org.apache.log4j.PropertyConfigurator.parseAppender(PropertyConfigurator.java:785)
	at org.apache.log4j.PropertyConfigurator.parseCategory(PropertyConfigurator.java:768)
	at org.apache.log4j.PropertyConfigurator.configureRootCategory(PropertyConfigurator.java:648)
	at org.apache.log4j.PropertyConfigurator.doConfigure(PropertyConfigurator.java:514)
	at org.apache.log4j.PropertyConfigurator.doConfigure(PropertyConfigurator.java:580)
	at org.apache.log4j.helpers.OptionConverter.selectAndConfigure(OptionConverter.java:526)
	at org.apache.log4j.LogManager.<clinit>(LogManager.java:127)
	at org.apache.log4j.Logger.getLogger(Logger.java:104)
	at org.apache.htrace.shaded.commons.logging.impl.Log4JLogger.getLogger(Log4JLogger.java:289)
	at org.apache.htrace.shaded.commons.logging.impl.Log4JLogger.<init>(Log4JLogger.java:109)
	at sun.reflect.NativeConstructorAccessorImpl.newInstance0(Native Method)
	at sun.reflect.NativeConstructorAccessorImpl.newInstance(NativeConstructorAccessorImpl.java:62)
	at sun.reflect.DelegatingConstructorAccessorImpl.newInstance(DelegatingConstructorAccessorImpl.java:45)
	at java.lang.reflect.Constructor.newInstance(Constructor.java:423)
	at org.apache.htrace.shaded.commons.logging.impl.LogFactoryImpl.createLogFromClass(LogFactoryImpl.java:1116)
	at org.apache.htrace.shaded.commons.logging.impl.LogFactoryImpl.discoverLogImplementation(LogFactoryImpl.java:914)
	at org.apache.htrace.shaded.commons.logging.impl.LogFactoryImpl.newInstance(LogFactoryImpl.java:604)
	at org.apache.htrace.shaded.commons.logging.impl.LogFactoryImpl.getInstance(LogFactoryImpl.java:336)
	at org.apache.htrace.shaded.commons.logging.impl.LogFactoryImpl.getInstance(LogFactoryImpl.java:310)
	at org.apache.htrace.shaded.commons.logging.LogFactory.getLog(LogFactory.java:685)
	at org.apache.htrace.core.HTraceConfiguration.<clinit>(HTraceConfiguration.java:31)
	at org.apache.htrace.core.Tracer$Builder.<init>(Tracer.java:47)
	at site.ycsb.Client.getTracer(Client.java:458)
	at site.ycsb.Client.main(Client.java:304)
log4j:ERROR Could not instantiate appender named "FilterLog".
Starting test.
2021-12-09 19:32:18:911 0 sec: 0 operations; est completion in 0 second 
2021-12-09 19:32:18,940 WARN  [Thread-23] util.NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
2021-12-09 19:32:19,484 INFO  [Thread-23] zookeeper.RecoverableZooKeeper: Process identifier=hconnection-0x53b4b89f connecting to ZooKeeper ensemble=zk0-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net:2181,zk3-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net:2181,zk1-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net:2181
2021-12-09 19:32:19,489 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:zookeeper.version=3.4.6-1569965, built on 02/20/2014 09:09 GMT
2021-12-09 19:32:19,489 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:host.name=hn0-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net
2021-12-09 19:32:19,489 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:java.version=1.8.0_312
2021-12-09 19:32:19,489 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:java.vendor=Azul Systems, Inc.
2021-12-09 19:32:19,489 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:java.home=/usr/lib/jvm/zulu-8-azure-amd64/jre
2021-12-09 19:32:19,489 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:java.class.path=/etc/hbase/conf:/home/sshuser/ycsb-0.17.0/hbase12-binding/conf:/home/sshuser/ycsb-0.17.0/conf:/home/sshuser/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/sshuser/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/sshuser/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/sshuser/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/sshuser/ycsb-0.17.0/lib/core-0.17.0.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/hbase12-binding-0.17.0.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/log4j-1.2.17.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/commons-logging-1.2.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/hbase10-binding-0.17.0.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/findbugs-annotations-1.3.9-1.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/slf4j-api-1.7.25.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/hbase-shaded-client-1.2.5.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/htrace-core-3.1.0-incubating.jar:/home/sshuser/ycsb-0.17.0/hbase12-binding/lib/slf4j-log4j12-1.6.1.jar
2021-12-09 19:32:19,489 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:java.library.path=/usr/java/packages/lib/amd64:/usr/lib64:/lib64:/lib:/usr/lib
2021-12-09 19:32:19,489 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:java.io.tmpdir=/tmp
2021-12-09 19:32:19,489 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:java.compiler=<NA>
2021-12-09 19:32:19,489 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:os.name=Linux
2021-12-09 19:32:19,489 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:os.arch=amd64
2021-12-09 19:32:19,489 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:os.version=5.4.0-1063-azure
2021-12-09 19:32:19,489 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:user.name=sshuser
2021-12-09 19:32:19,489 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:user.home=/home/sshuser
2021-12-09 19:32:19,489 INFO  [Thread-23] zookeeper.ZooKeeper: Client environment:user.dir=/home/sshuser
2021-12-09 19:32:19,490 INFO  [Thread-23] zookeeper.ZooKeeper: Initiating client connection, connectString=zk0-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net:2181,zk3-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net:2181,zk1-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net:2181 sessionTimeout=120000 watcher=hconnection-0x53b4b89f0x0, quorum=zk0-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net:2181,zk3-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net:2181,zk1-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net:2181, baseZNode=/hbase-unsecure
2021-12-09 19:32:19,508 INFO  [Thread-23-SendThread(zk1-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net:2181)] zookeeper.ClientCnxn: Opening socket connection to server zk1-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net/10.0.0.4:2181. Will not attempt to authenticate using SASL (unknown error)
2021-12-09 19:32:19,516 INFO  [Thread-23-SendThread(zk1-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net:2181)] zookeeper.ClientCnxn: Socket connection established to zk1-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net/10.0.0.4:2181, initiating session
2021-12-09 19:32:19,529 INFO  [Thread-23-SendThread(zk1-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net:2181)] zookeeper.ClientCnxn: Session establishment complete on server zk1-yolodb.5vakhkcg4fweloe5xpowwvve1b.px.internal.cloudapp.net/10.0.0.4:2181, sessionid = 0x27da07e24080020, negotiated timeout = 120000
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2021-12-09 19:32:28:901 10 sec: 19087 operations; 1908.51 current ops/sec; est completion in 43 seconds [READ: Count=19111, Max=134911, Min=335, Avg=1170.75, 90=1331, 99=7547, 99.9=53759, 99.99=128255] [READ-MODIFY-WRITE: Count=9633, Max=243199, Min=5360, Avg=21059.42, 90=34047, 99=87039, 99.9=217855, 99.99=241407] [UPDATE: Count=9646, Max=242687, Min=4612, Avg=19886.28, 90=32751, 99=76607, 99.9=216959, 99.99=240511] 
2021-12-09 19:32:38:901 20 sec: 39057 operations; 1997 current ops/sec; est completion in 32 seconds [READ: Count=19969, Max=26095, Min=332, Avg=942.96, 90=1231, 99=4919, 99.9=10375, 99.99=24703] [READ-MODIFY-WRITE: Count=10012, Max=293119, Min=5020, Avg=22980.63, 90=35327, 99=189439, 99.9=272895, 99.99=292351] [UPDATE: Count=10004, Max=292607, Min=4400, Avg=22026.67, 90=34175, 99=188671, 99.9=270335, 99.99=291839] 
2021-12-09 19:32:48:901 30 sec: 59148 operations; 2009.1 current ops/sec; est completion in 21 seconds [READ: Count=20092, Max=15399, Min=314, Avg=945.7, 90=1255, 99=5315, 99.9=9359, 99.99=14583] [READ-MODIFY-WRITE: Count=10043, Max=375295, Min=4876, Avg=22943.34, 90=35871, 99=155647, 99.9=353535, 99.99=375295] [UPDATE: Count=10047, Max=374783, Min=4368, Avg=21991.79, 90=34911, 99=154495, 99.9=352767, 99.99=374783] 
2021-12-09 19:32:58:901 40 sec: 79454 operations; 2030.6 current ops/sec; est completion in 11 seconds [READ: Count=20305, Max=13743, Min=343, Avg=974.31, 90=1324, 99=5171, 99.9=9263, 99.99=11327] [READ-MODIFY-WRITE: Count=10216, Max=345599, Min=4996, Avg=22514, 90=34591, 99=134655, 99.9=314623, 99.99=345343] [UPDATE: Count=10207, Max=345087, Min=4560, Avg=21539.81, 90=33631, 99=133887, 99.9=313599, 99.99=344319] 
2021-12-09 19:33:08,821 INFO  [Thread-23] client.ConnectionManager$HConnectionImplementation: Closing zookeeper sessionid=0x27da07e24080020
2021-12-09 19:33:08,829 INFO  [Thread-23-EventThread] zookeeper.ClientCnxn: EventThread shut down
2021-12-09 19:33:08,829 INFO  [Thread-23] zookeeper.ZooKeeper: Session: 0x27da07e24080020 closed
2021-12-09 19:33:08:844 49 sec: 100000 operations; 2066.38 current ops/sec; [READ: Count=20523, Max=17631, Min=330, Avg=892.66, 90=1158, 99=4005, 99.9=8943, 99.99=11967] [READ-MODIFY-WRITE: Count=10274, Max=235775, Min=4840, Avg=20685.5, 90=32719, 99=109631, 99.9=222591, 99.99=235647] [CLEANUP: Count=48, Max=47263, Min=3, Avg=1002.33, 90=26, 99=47263, 99.9=47263, 99.99=47263] [UPDATE: Count=10274, Max=235263, Min=4408, Avg=19791.67, 90=31919, 99=109055, 99.9=221311, 99.99=234879] 
[OVERALL], RunTime(ms), 49943
[OVERALL], Throughput(ops/sec), 2002.2826021664698
[TOTAL_GCS_PS_Scavenge], Count, 21
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 170
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.34038804236829984
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 21
[TOTAL_GC_TIME], Time(ms), 170
[TOTAL_GC_TIME_%], Time(%), 0.34038804236829984
[READ], Operations, 100000
[READ], AverageLatency(us), 983.08639
[READ], MinLatency(us), 314
[READ], MaxLatency(us), 134911
[READ], 95thPercentileLatency(us), 1728
[READ], 99thPercentileLatency(us), 5163
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 50178
[READ-MODIFY-WRITE], AverageLatency(us), 22039.403762605125
[READ-MODIFY-WRITE], MinLatency(us), 4840
[READ-MODIFY-WRITE], MaxLatency(us), 375295
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 44319
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 127295
[CLEANUP], Operations, 48
[CLEANUP], AverageLatency(us), 1002.3333333333334
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 47263
[CLEANUP], 95thPercentileLatency(us), 48
[CLEANUP], 99thPercentileLatency(us), 47263
[UPDATE], Operations, 50178
[UPDATE], AverageLatency(us), 21051.572601538523
[UPDATE], MinLatency(us), 4368
[UPDATE], MaxLatency(us), 374783
[UPDATE], 95thPercentileLatency(us), 43199
[UPDATE], 99thPercentileLatency(us), 125375
[UPDATE], Return=OK, 50178